
# Дан список чисел, необходимо его развернуть без использования метода revese и
# функции reversed, а так же дополнительного списка и среза

l = [1, 2, 3, 5, 7, 9]
print(l)
l = l[::-1]
print(l)






