# Пользователь вводит предложение, заменить все пробелы на "-" 2-мя
# способами

# Пользователь вводит 3 числа, найти среднее арифмитическое с
# точность 3

# Пользователь вводит Имя, Возраст и Город, сформировать
# приветственное сообщение путем форматирования 3-мя способами

# Пользователь вводит 3 числа, сказать сколько из них положительных
# и сколько отрицательных

# Каждую задачу оформляем в отдельный файл с именем в формате:
# номерзанятия_номерзадачи, все решения отправить в свой
# репозиторий в отдельную ветку HomeWork